Subarno11/stm32F446-Baremetal-drivers/STM32_Drivers/drivers/Src/stm32f446xx_usart_drivers.c
	}

	return rxstate;

}

/*********************************************************************
 * @fn      		  - USART_PeripheralControl
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @return            -
 *
 * @Note              -

 */

void USART_PeripheralControl(USART_RegDef_t *pUSARTx , uint8_t EnorDi){
	if(EnorDi == ENABLE){
		pUSARTx->USART_CR1 |= (1 << USART_CR1_UE);
	}

	else{
		pUSARTx->USART_CR1 &= ~(1 << USART_CR1_UE);
	}
}

/*********************************************************************
 * @fn      		  - USART_GetFlagStatus
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @return            -
 *
 * @Note              -

 */

uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint16_t FlagName){
	if(pUSARTx->USART_SR & FlagName){
		return FLAG_SET;
	}
	return FLAG_RESET;
}

/*********************************************************************
 * @fn      		  - USART_GetFlagStatus
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @return            -
 *
 * @Note              -

 */

void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t FlagName){
	volatile uint32_t dummyRead;

		if(FlagName == USART_FLAG_PE || FlagName == USART_FLAG_FE || FlagName == USART_FLAG_NF || FlagName == USART_FLAG_ORE|| FlagName == USART_FLAG_IDLE ){
			dummyRead = pUSARTx->USART_SR;
			dummyRead= pUSARTx->USART_DR;
		}

		else if(FlagName == USART_FLAG_CTS || FlagName == USART_FLAG_LBD || FlagName == USART_FLAG_TC){
			pUSARTx->USART_SR &= ~FlagName;
		}

	(void)dummyRead;
}

/*********************************************************************
 * @fn      		  - USART_GetFlagStatus
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @return            -
 *
 * @Note              -

 */
void USART_IRQInterruptConfig(uint8_t IRQNumber , uint8_t EnorDi){
	if(EnorDi == ENABLE){
		if(IRQNumber <= 31){
			//Program ISER0 register
			*NVIC_ISER0 |= (1<<IRQNumber); //1 = interrupt enabled , 0 = no effect
		}

		else if(IRQNumber > 31 && IRQNumber < 64){
			//Program ISER1 register
			*NVIC_ISER1 |= (1<<IRQNumber % 32); //1 = interrupt enabled , 0 = no effect

		}
		else if(IRQNumber >= 64 && IRQNumber < 96){
			//Program ISER2 register
			*NVIC_ISER2 |= (1<<IRQNumber % 64); //1 = interrupt enabled , 0 = no effect
		}
	}
	else{
		if(IRQNumber <= 31){
			//Program ISER0 register
			*NVIC_ICER0 |= (1<<IRQNumber); //1 = interrupt disabled , 0 = no effect
		}

		else if(IRQNumber > 31 && IRQNumber < 64){
			//Program ISER1 register
			*NVIC_ICER1 |= (1<<IRQNumber % 32); //1 = interrupt disabled , 0 = no effect

		}
		else if(IRQNumber >= 64 && IRQNumber < 96){
			//Program ISER2 register
			*NVIC_ICER2 |= (1<<IRQNumber % 64); //1 = interrupt disabled , 0 = no effect
		}
	}
}
void USART_IRQPriorityConfig(uint8_t IRQNumber , uint32_t IRQPriority){
	//1.first lets find out the ipr register
	//Each iprx is 32 bits and is divided into 4 sections each having an IRQ number and each of 8 bit
	uint8_t iprx = IRQNumber/4;
	uint8_t iprx_section = IRQNumber%4;
	uint8_t shift_amount = (8 * iprx_section) + (8- NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR_BASE_ADDR + iprx) &= ~(0xF <<shift_amount);
	*(NVIC_PR_BASE_ADDR + iprx) |= (IRQPriority << shift_amount);
}


/*********************************************************************
 * @fn      		  - USART_IRQHandler
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Resolve all the TODOs

 */
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{

	uint32_t temp1 , temp2, temp3;

/*************************Check for TC flag ********************************************/

    //Implement the code to check the state of TC bit in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_SR & ( 1 << USART_SR_TC);

	 //Implement the code to check the state of TCEIE bit
	temp2 = pUSARTHandle->pUSARTx->USART_CR1 & ( 1 << USART_CR1_TCIE);

	if(temp1 && temp2 )
	{
		//this interrupt is because of TC

		//close transmission and call application callback if TxLen is zero
		if ( pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
		{
			//Check the TxLen . If it is zero then close the data transmission
			if(! pUSARTHandle->TxLen )
			{
				//Implement the code to clear the TC flag
				USART_ClearFlag(pUSARTHandle->pUSARTx, USART_FLAG_TC);

				//Implement the code to clear the TCIE control bit
				pUSARTHandle->pUSARTx->USART_CR1 &= ~(1 << USART_CR1_TCIE);

				//Reset the application state
				pUSARTHandle->TxBusyState = USART_READY;

				//Reset Buffer address to NULL
				pUSARTHandle->pTxBuffer = NULL;

				//Reset the length to zero
				pUSARTHandle->TxLen = 0;

				//Call the applicaton call back with event USART_EVENT_TX_CMPLT
				USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_TX_CMPLT);
			}
		}
	}

/*************************Check for TXE flag ********************************************/

	//Implement the code to check the state of TXE bit in the SR
	temp1 = pUSARTHandle->pUSARTx->USART_SR & ( 1 << USART_SR_TXE);

	//Implement the code to check the state of TXEIE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->USART_CR1 & ( 1 << USART_CR1_TXEIE);

	uint16_t *pdata;
	if(temp1 && temp2 )
	{
		//this interrupt is because of TXE

		if(pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
		{
			//Keep sending data until Txlen reaches to zero
			if(pUSARTHandle->TxLen > 0)
			{
				//Check the USART_WordLength item for 9BIT or 8BIT in a frame
				if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
				{
					//if 9BIT , load the DR with 2bytes masking the bits other than first 9 bits
					pdata = (uint16_t*)pUSARTHandle->pTxBuffer;

					//loading only first 9 bits , so we have to mask with the value 0x01FF
					pUSARTHandle->pUSARTx->USART_DR = (*pdata & (uint16_t)0x01FF);

					//check for USART_ParityControl
					if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
					{
						//No parity is used in this transfer , so, 9bits of user data will be sent
						//Implement the code to increment pTxBuffer twice
						pUSARTHandle->pTxBuffer +=2;

						//Implement the code to decrement the length
						pUSARTHandle->TxLen -=2;
					}
					else
					{
						//Parity bit is used in this transfer . so , 8bits of user data will be sent
						//The 9th bit will be replaced by parity bit by the hardware
						pUSARTHandle->pTxBuffer++;

						//Implement the code to decrement the length
						pUSARTHandle->TxLen--;
					}
				}
				else
				{
					//This is 8bit data transfer
					pUSARTHandle->pUSARTx->USART_DR = (*pUSARTHandle->pTxBuffer  & (uint8_t)0xFF);

